{
    "home": "Home",
    "projects": "Projects",
    "about": "About Me",
    "contact": "Contact",
    "page-title-1": "Highlights",
    "page-title-2": "All my projects",
    "page-title-3": "Who I am?",
    "page-title-4": "All my contacts",
    "page-title-5": "Ups! Page not found!",
    "support": "Support Me",
    "games-w": "Videogames",
    "web-w": "Websites",
    "desk-w": "Desktop Apps",
    "art-w": "Artistic",
    "state-w-1": "In progress",
    "state-w-2": "Finished",
    "nothing-here": "Nothing here yet",
    "in-progress": "This page is still in progress",
    "go-project": "Go project",
    "v-description": "view description",
    "games-w-11-title": "The State of Nowhere",
    "games-w-12-title": "Shapes And Colors",
    "web-w-31-title": "Portafolio 1",
    "web-w-32-title": "Quote Machine",
    "web-w-33-title": "Drum Machine",
    "web-w-34-title": "Markdown Previewer",
    "web-w-35-title": "Calculator",
    "web-w-36-title": "Clock",
    "web-w-37-title": "Portafolio 2",
    "copy-msje-1": "Content copied to clipboard",
    "copy-msje-2": "Failed to copy",
    "games-w-11-description": "A game where you got a job in the food distribution center of the state of Nowhere!",
    "games-w-12-description": "A mobile game for kids, where they can interact with shapes and colors",
    "web-w-31-description": "A simple responsive portafolio. Made only with HTML and CSS ",
    "web-w-32-description": "A quote generator. I used technologies like JQuery and Bootstrap in it",
    "web-w-33-description": "A drum player. I included technologies like JQuery and Bootstrap in it",
    "web-w-34-description": "I used a markdown parser like marked, also JQuery",
    "web-w-35-description": "A simple calculator made with React",
    "web-w-36-description": "A clock with alarm made with React",
    "web-w-37-description": "A portafolio made with React, Vite, ReactRouter, Bootstrap and React-i18n",
    "about-p1": "Hello there! My name is Abel. And I'm the person behind Anomaly Works. I'm currently immersed in the world of indie game development, as well as web development. But that's the summary, let me tell you a little more about me.",
    "about-p2": "Throughout my childhood I have always felt a taste for building things, drawing being the main way to manifest it at that stage, as well as disassembling and reassembling what I found. As I grew up, I was able to explore other fields such as sculpture, painting, agriculture, carpentry, and masonry, and these experiences were very rewarding. It wasn't until I was a teenager that my father gave me my first personal computer, a Commodore KE-7000MB netbook, and I immersed myself in the world of technology...",
    "about-p3": "From that moment on, and with the arrival of the Internet in my life, I explored subjects such as graphic design, general computer science, audiovisual editing, and video game development. I remember that my first approach to this world was with MUGEN, a fighting game engine, in which I designed sprites for characters, or at least that's what I tried to do.",
    "about-p4": "A while later, already in college, studying for a degree in Systems Analyst, I developed a liking for logic and algorithms, solving problems with languages like Java and Pascal. It was also there that I was able to take a course on video games. The goal of this course was to create a video game using a tool called pilas-engine, which, using Python, offered a variety of components characteristic of a video game, so that you could program it and learn to program. It was at that time that I proposed the implementation of a fighting video game, a kind of 'The Kings Of Fighters', but with only one menu and two characters that were assigned to each player for the time that we had at our disposal. ",
    "about-p5": "I got to work and started by identifying the processes and sub-processes that the game went through, that is, the menu, the presentation of the characters, the start of the round, the start of the fight, the reception of blows, the conclusion, and so on. Reviewing the documentation and researching the components that fit my goal, such as scenes, buttons, the life bar, the characters, the counter, and so on, seeing how they work, their methods and properties, as well as the components that I had to implement on my own. And based on all that, and with a little bit of ingenuity, developed the game that ended up being successful. The whole mental process of doing it, the experience, was really very enriching and gave me some guidelines for what would come later.",
    "about-p6": "Far away from the university, I decided to undertake the development of my first videogame as such, <0>The State of Nowhere</0>, but not before gaining more experience in programming websites, Android applications and other desktop applications. The description of most of the projects I have developed so far can be found at this <1>link</1>.",
    "about-p7": "As for the present, I am finishing the development of my first videogame, in addition to all the tasks involved in launching a video game. Simultaneously, I take time for web development projects, which allow me to expand my knowledge in this field. At the moment I have a frontend profile and my intention is to delve further into the backend and other interesting technologies related to testing and performance.",
    "about-p8": "And that is a summary, in broad strokes, of who is writing to you. If you want to follow my activities more closely, I invite you to follow me on one of my <0>social media</0>.",
    "about-p9": "Warm regards,",
    "w-11-p-1": "You can find more information about this project on my personal <0>Twitter</0> account.",
    "w-11-p-2": "You got a job in the food distribution center of the state of Nowhere! Country whose new authorities seek to subdue the population under their rule, severely restricting access to food.",
    "w-11-p-3": "The state will equip your workstation with the necessary tools to perform your duties as employee 100411.",
    "w-11-p-4": "It will be your duty to carry out the controls that the state deems necessary to keep the population in line.",
    "w-11-p-5": "Under the new food reorganization program, you must strictly adhere to the regulations if you want to avoid facing the consequences.",
    "w-11-p-6": "All those employees who serve the state exceptionally will be blessed by our honorable president, Maligno."
}